IdeaRS.OpenModel.Detail.Loading.LineLoad
Line load

IdeaRS.OpenModel.Detail.Loading.LineLoad.#ctor
constructor

IdeaRS.OpenModel.Detail.Loading.LineLoad.Name
Gets or set the name

IdeaRS.OpenModel.Detail.Loading.LineLoad.BegFx
force in X at biginning

IdeaRS.OpenModel.Detail.Loading.LineLoad.EndFx
force in X at end

IdeaRS.OpenModel.Detail.Loading.LineLoad.BegFy
force in Y at beginning

IdeaRS.OpenModel.Detail.Loading.LineLoad.EndFy
force in Y at end

IdeaRS.OpenModel.Detail.Loading.LineLoad.Direction
local / global

IdeaRS.OpenModel.Detail.Loading.LineLoad.GeometryPointsPath
list of line load points

IdeaRS.OpenModel.Detail.Loading.LineLoad.ResultantForces
forces value

IdeaRS.OpenModel.Detail.Loading.LineLoad.BegPositionX
point support position X

IdeaRS.OpenModel.Detail.Loading.LineLoad.BegPositionY
point support position Y

IdeaRS.OpenModel.Detail.Loading.LineLoad.EndPositionX
point support position X

IdeaRS.OpenModel.Detail.Loading.LineLoad.EndPositionY
point support position Y

IdeaRS.OpenModel.Detail.Loading.LineLoad.DirectionType
direction type of load

IdeaRS.OpenModel.Detail.Loading.LineLoad.Angle
angle of load

IdeaRS.OpenModel.Detail.Loading.LineLoad.TypeLinePosition
type of position

IdeaRS.OpenModel.Detail.Loading.LineLoad.MasterComponent
Gets or sets the master component

IdeaRS.OpenModel.Detail.Loading.LineLoad.MasterEdge
master component edge

IdeaRS.OpenModel.Detail.Loading.LineLoad.MasterPoint
master point

IdeaRS.OpenModel.Detail.Loading.LineLoad.TypeEdgePosition
edge position type

IdeaRS.OpenModel.Detail.Loading.LineLoad.EdgePositionType
edge position type

IdeaRS.OpenModel.Detail.Loading.LineLoad.PositionOnEdge
position od edge

IdeaRS.OpenModel.Detail.Loading.LineLoad.LengthOnEdge
length of load

IdeaRS.OpenModel.Detail.Loading.LineLoad.GeneralLine
general shape